Refined Readme.md
